ArtronShop/Arduino_Core_STM32/boards.txt
# See: https://arduino.github.io/arduino-cli/latest/platform-specification/

menu.pnum=Board part number

menu.xserial=U(S)ART support
menu.usb=USB support (if available)
menu.xusb=USB speed (if available)
menu.virtio=Virtual serial support

menu.opt=Optimize
menu.dbg=Debug symbols and core logs
menu.rtlib=C Runtime Library
menu.upload_method=Upload method

###############################
# ArtronShop Nano G4
NanoG4.name=ArtronShop Nano G4

NanoG4.build.core=arduino
NanoG4.build.board=ARTRONSHOP_NANO_G4
NanoG4.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
NanoG4.build.mcu=cortex-m4
NanoG4.build.fpu=-mfpu=fpv4-sp-d16
NanoG4.build.float-abi=-mfloat-abi=hard
NanoG4.build.series=STM32G4xx
NanoG4.build.cmsis_lib_gcc=arm_cortexM4lf_math
NanoG4.build.flash_offset=0x0
NanoG4.build.product_line=STM32G431xx
NanoG4.build.variant=ArtronShop-Nano-G4
NanoG4.build.variant_h=variant_{build.board}.h
NanoG4.upload.maximum_size=131072
NanoG4.upload.maximum_data_size=32768

NanoG4.build.xSerial=-DHAL_UART_MODULE_ENABLED
NanoG4.build.flags.optimize=-Os -flto

NanoG4.menu.dbg.none=None
NanoG4.menu.dbg.enable_sym=Symbols Enabled (-g)
NanoG4.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
NanoG4.menu.dbg.enable_log=Core logs Enabled
NanoG4.menu.dbg.enable_log.build.flags.debug=
NanoG4.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
NanoG4.menu.dbg.enable_all.build.flags.debug=-g

NanoG4.menu.rtlib.nano=Newlib Nano (default)
NanoG4.menu.rtlib.nanofp=Newlib Nano + Float Printf
NanoG4.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
NanoG4.menu.rtlib.nanofs=Newlib Nano + Float Scanf
NanoG4.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
NanoG4.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
NanoG4.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
NanoG4.menu.rtlib.full=Newlib Standard
NanoG4.menu.rtlib.full.build.flags.ldspecs=

NanoG4.upload.protocol=serial
NanoG4.upload.options=-c {serial.port.file}
NanoG4.upload.tool=stm32CubeProg


###############################
# Thotsakan
Thotsakan.name=Thotsakan

Thotsakan.build.core=arduino
Thotsakan.build.board=THOTSAKAN
Thotsakan.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
Thotsakan.build.mcu=cortex-m4
Thotsakan.build.fpu=-mfpu=fpv4-sp-d16
Thotsakan.build.float-abi=-mfloat-abi=hard
Thotsakan.build.series=STM32G4xx
Thotsakan.build.cmsis_lib_gcc=arm_cortexM4lf_math
Thotsakan.build.flash_offset=0x0
Thotsakan.build.product_line=STM32G431xx
Thotsakan.build.variant=Thotsakan
Thotsakan.build.variant_h=variant_{build.board}.h
Thotsakan.upload.maximum_size=131072
Thotsakan.upload.maximum_data_size=32768

Thotsakan.build.xSerial=-DHAL_UART_MODULE_ENABLED
Thotsakan.build.flags.optimize=-Os -flto

Thotsakan.menu.dbg.none=None
Thotsakan.menu.dbg.enable_sym=Symbols Enabled (-g)
Thotsakan.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Thotsakan.menu.dbg.enable_log=Core logs Enabled
Thotsakan.menu.dbg.enable_log.build.flags.debug=
Thotsakan.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Thotsakan.menu.dbg.enable_all.build.flags.debug=-g

Thotsakan.menu.rtlib.nano=Newlib Nano (default)
Thotsakan.menu.rtlib.nanofp=Newlib Nano + Float Printf
Thotsakan.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Thotsakan.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Thotsakan.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Thotsakan.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Thotsakan.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Thotsakan.menu.rtlib.full=Newlib Standard
Thotsakan.menu.rtlib.full.build.flags.ldspecs=

Thotsakan.upload.protocol=serial
Thotsakan.upload.options=-c {serial.port.file}
Thotsakan.upload.tool=stm32CubeProg
